{"posts":[{"title":"Spaghetti with Quick Turkey Chili","subtitle":"Turn ground turkey into an easy chili and serve over spaghetti for dinner that's done in just 35 minutes.","subtitle2":"This one recipe will change your life forever!","body":"Get the Recipe: Spaghetti With Quick Turkey Chili","imgurl":"http://i.imgur.com/x52b5mN.jpg"},{"title":"Rachael's Lemon Chicken","subtitle":"Turn your dinner into a takeout-inspired meal at home with Rachael Ray's chicken dish.","body":"Get the Recipe: Lemon Chicken","subtitle2":"This one recipe will change your life forever!","imgurl":"http://i.imgur.com/4qdE3B6.jpg"},{"title":"Maple-Glazed Chicken","subtitle":"Toss chicken with apples and maple syrup for a delicious dinner that's ready in just 30 minutes.","body":"Get the Recipe: Maple-Glazed Chicken","subtitle2":"This one recipe will change your life forever!","imgurl":"http://i.imgur.com/eW32xOa.jpg"},{"title":"Salisbury Steak with Mushrooms","subtitle":"Smother ground beef and sage patties with a mixed mushroom sauce and serve with buttered egg noodles.","body":"Get the Recipe: Salisbury Steak With Mushrooms","subtitle2":"This one recipe will change your life forever!","imgurl":"http://i.imgur.com/5QP6aqT.jpg"},{"title":"Winter Minestrone","subtitle":"Pureed cannellini beans with beef broth add a creaminess to this hearty soup, and whole cannellini beans add another layer of texture.","body":"Giada De Laurentiis' secret weapon in this recipe is a frozen Parmesan rind: It melts slowly and adds a salty, buttery flavor to the soup. Get the Recipe: Winter Minestrone","imgurl":"http://i.imgur.com/UWBt6L0.jpg","subtitle2":"This one recipe will change your life forever!"},{"title":"How to Make Japanese Katsu at Home","subtitle":"If you weren't familiar with Japanese cuisine, you might not think there was anything particularly Japanese about katsu, a simple dish of breaded and fried cutlets.","body":"But if you've ever been in a Japanese shopping mall food court, you've seen that, just like pizza in the US, katsu has established itself so firmly in the food culture that it could be considered a national comfort-food staple. It's an easy dish to love. Juicy chicken or pork cutlets in an incredibly crisp layer of golden-brown bread crumbs, with a sweet-and-savory sauce and a side of crisp shredded cabbage and steamed white rice, is a simple and delicious weeknight meal, whether you buy it at the food court or fry it in your own kitchen.","imgurl":"/images/20170125tonkatsujapaneseporkchickenkatsucutletrecipe21thumb1500xauto436300.jpg"},{"title":"Making Pesto or Curry Paste? The Freezer Is Your Friend","subtitle":"In many cases, freezing fresh basil before incorporating it into pesto will produce tastier results.","body":"I know, I find it hard to believe myself. But hear me out, because there's a good explanation for all of this.\n\nThis whole idea came about because my refrigerator is broken. Every couple of weeks, it decides to kick its compressor into high gear, and everything on the bottom shelf ends up freezing solid. That's what happened recently to the ginger and lemongrass I was storing in there. I ended up deciding to use that frozen-then-thawed lemongrass and ginger in a Thai-style curry paste, and was frankly surprised at how easily they incorporated into the mix in my mortar and pestle. Then it occurred to me: Perhaps freezing aromatics is a good thing?","imgurl":"/images/20140714pestotestingvickywasik34thumb1500xauto407556thumb1500xauto437955.jpg"},{"title":"Chacarero Chileno, a Steak Sandwich as Delicious as It Is Unlikely","subtitle":"On paper the sandwich seems... weird. Grilled meat, sliced tomato, and cooked green beans.","body":"t reminds me of the feeling I get when I eat most burritos: Dang, this stuff would be so much better served separately on a plate. Chacareros are also similar to burritos in that they are typically consumed late at night at neighborhood greasy spoons when you're slightly inebriated. All I can tell you is, when done properly, it works, and in honor of my memories of freshman-year-me, I decided to head into the kitchen (and out to the patio) to try and bring that vision of the perfect chacarero from my head and into reality.","imgurl":"/images/20170623steaksandwichchacarero32thumb1500xauto438207.jpg"},{"title":"Katsu at Home 2","subtitle":"If you weren't familiar with Japanese cuisine, you might not think there was anything particularly Japanese about katsu, a simple dish of breaded and fried cutlets.","body":"But if you've ever been in a Japanese shopping mall food court, you've seen that, just like pizza in the US, katsu has established itself so firmly in the food culture that it could be considered a national comfort-food staple. It's an easy dish to love. Juicy chicken or pork cutlets in an incredibly crisp layer of golden-brown bread crumbs, with a sweet-and-savory sauce and a side of crisp shredded cabbage and steamed white rice, is a simple and delicious weeknight meal, whether you buy it at the food court or fry it in your own kitchen.","imgurl":"/images/20170125tonkatsujapaneseporkchickenkatsucutletrecipe21thumb1500xauto436300.jpg"},{"title":"The Freezer Is Your Friend II","subtitle":"In many cases, freezing fresh basil before incorporating it into pesto will produce tastier results.","body":"I know, I find it hard to believe myself. But hear me out, because there's a good explanation for all of this.\n\nThis whole idea came about because my refrigerator is broken. Every couple of weeks, it decides to kick its compressor into high gear, and everything on the bottom shelf ends up freezing solid. That's what happened recently to the ginger and lemongrass I was storing in there. I ended up deciding to use that frozen-then-thawed lemongrass and ginger in a Thai-style curry paste, and was frankly surprised at how easily they incorporated into the mix in my mortar and pestle. Then it occurred to me: Perhaps freezing aromatics is a good thing?","imgurl":"/images/20140714pestotestingvickywasik34thumb1500xauto407556thumb1500xauto437955.jpg"},{"title":"Last Post","subtitle":"On paper the sandwich seems... weird. Grilled meat, sliced tomato, and cooked green beans.","body":"Most recipes for chacarero call for thinly sliced, fine-textured beef like sirloin or round. The problem with these cuts is that no matter how thinly you slice them, they tend to hold together quite well, which leads to the dreaded pull-out: you take one bite, and and entire slice of steak comes with you, leaving you with a piece of meat hanging awkwardly out of your mouth and three-fourths of a sandwich with nothing but condiments. To top it off, they aren't even particularly meaty or flavorful cuts. Instead, I like to turn to more substantially beefy, loosely-textured cuts like hanger, skirt, or flap meat. I happen to live a block away from a Mexican butcher that sells skirt and thinly sliced flap meat for fajitas and tortas, which makes them perfect for this sandwich. Most recipes for chacarero call for thinly sliced, fine-textured beef like sirloin or round. The problem with these cuts is that no matter how thinly you slice them, they tend to hold together quite well, which leads to the dreaded pull-out: you take one bite, and and entire slice of steak comes with you, leaving you with a piece of meat hanging awkwardly out of your mouth and three-fourths of a sandwich with nothing but condiments. To top it off, they aren't even particularly meaty or flavorful cuts. Instead, I like to turn to more substantially beefy, loosely-textured cuts like hanger, skirt, or flap meat. I happen to live a block away from a Mexican butcher that sells skirt and thinly sliced flap meat for fajitas and tortas, which makes them perfect for this sandwich.","imgurl":"/images/20170623steaksandwichchacarero32thumb1500xauto438207.jpg"},{"title":"sdadsasd323as1","subtitle":"213xda1321d3a2s123asd123","body":"q132dfsa132ads123das123","imgurl":"/images/goldenmanlaughs.jpg"}]}